resolved-ios-10.3.3-jb-error.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-10-23 Sun 15:38 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>resolved iOS 10.3.3 JB error</title>
<meta name="author" content="yefeiyu" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="/favicon.ico">
<meta name="theme-color" content="#ffffff">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/style/toc.css"/>
<link rel="stylesheet" href="/style/tufte.css"/>
<link rel="stylesheet" href="/style/main.css"/>
<link rel="alternate" type="application/rss+xml" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="preamble" class="status">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-NJRFJGX"
                  height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header>
    <a accesskey="h" href="/index.html"> HOME </a> |
    <a href="#" id="edit-in-github">EDIT</a> |
    <a href="https://yefeiyu.github.io/index.xml">RSS</a> |
    <a accesskey="H" href="/about.html">ABOUT</a> |
    <a href="https://github.com/yefeiyu">GITHUB</a>
</header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">resolved iOS 10.3.3 JB error</h1>
</header><p>
yalu越狱每周签名，直接使用Impackor会出现错误，需要先清理锁定项。步骤如下：
插上手机，打开943程序，点选xcode-revolke，去掉上次遗留在手机里的锁定项。
退出943。
打开944程序，Device-InstallPackage-yalu102_beta7.ipa(此处不必使用10.0版本可以直接用10.3.3版本的ipa)
jb。
</p>

<p>
944 download address:
<a href="https://cache.saurik.com/impactor/l64/Impactor64_0.9.44.tgz">https://cache.saurik.com/impactor/l64/Impactor64_0.9.44.tgz</a>
943 download address:
<a href="https://cache.saurik.com/impactor/l64/Impactor64_0.9.43.tgz">https://cache.saurik.com/impactor/l64/Impactor64_0.9.43.tgz</a>
yalu102 download address:
<a href="https://yalujailbreak.org/files/yalu102_beta7.ipa">https://yalujailbreak.org/files/yalu102_beta7.ipa</a>
</p>
</div>
<div id="postamble" class="status">
<footer>
  <p>Author: yefeiyu <a aria-label="Follow @yefeiyu on GitHub" data-count-aria-label="# followers on GitHub" data-count-api="/users/jcouyang#followers" data-count-href="/jcouyang/followers" href="https://github.com/yefeiyu class="github-button">Follow @yefeiyu</a></p>
  <p>Modified: 2022-10-22 Sat 16:50</p>
  <p>Generated by: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.3) &#215; <a href="https://github.com/jcouyang/orgpress">OrgPress</a></p>
</footer>
</div>
</body>
</html>
